/* Strings for the alert dialogs displayed to notify the user about connection errors. */


/* GenericStreamError Title */
"GenericStreamError_Title" = "Erro de Ligação";

/* GenericStreamError Message */
"GenericStreamError_Msg" = "Ocorreu um erro de ligação desconhecido.";


/* StreamConflict Title */
"StreamConflict_Title" = "A sua ligação foi cancelada por outra aplicação!";

/* StreamConflict Message */
"StreamConflict_Msg" = "O servidor fechou a ligação porque outra aplicação se ligou utilizando exactamente a mesma configuração. Escolha nomes de Localização diferentes se quiser ligar-se na mesma conta com várias aplicações diferentes ao mesmo tempo. Defina um nome diferente para esta Localização na secção \"Contas\" das preferências da aplicação.";


/* ConnectionTimeout Title */
"ConnectionTimeout_Title" = "Timeout de Ligação";

/* ConnectionTimeout Message */
"ConnectionTimeout_Msg" = "Não foi obtida resposta do servidor dentro do tempo pré-estabelecido.";


/* InternalServerError Title */
"InternalServerError_Title" = "Erro Interno do Servidor";

/* InternalServerError Message */
"InternalServerError_Msg" = "Ocorreu um erro interno do servidor.";


/* SystemShutdown Title */
"SystemShutdown_Title" = "O servidor vai ser desligado.";

/* SystemShutdown Message */
"SystemShutdown_Msg" = "A sua ligação vai ser fechada porque o servidor vai ser desligado.";


/* ConnectionRefused Title */
"ConnectionRefused_Title" = "Ligação Recusada";

/* ConnectionRefused Message */
"ConnectionRefused_Msg" = "A ligação foi recusada pelo servidor.";


/* HostNotFound Title */
"HostNotFound_Title" = "Servidor Não Encontrado";

/* HostNotFound Message */
"HostNotFound_Msg" = "O nome de servidor da sua conta não foi encontrado.";


/* ProxyConnectionError Title */
"ProxyConnectionError_Title" = "Erro de Ligação ao Proxy";

/* ProxyConnectionError Message */
"ProxyConnectionError_Msg" = "Ocorreu um erro durante a tentativa de ligação ao servidor de proxy.";


/* ProxyAuthenticationError Title */
"ProxyAuthenticationError_Title" = "Erro de Autenticação no Proxy";

/* ProxyAuthenticationError Message */
"ProxyAuthenticationError_Msg" = "Ocorreu um erro de autenticação durante a tentativa de ligação ao servidor de proxy. Verifique as suas configurações do Proxy.";


/* UnknownHost Title */
"UnknownHost_Title" = "Servidor Desconhecido";

/* UnknownHost Message */
"UnknownHost_Msg" = "O nome de servidor da sua conta é desconhecido.";


/* NegotiationError Title */
"NegotiationError_Title" = "Erro de Negociação de Protocolo";

/* NegotiationError Message */
"NegotiationError_Msg" = "Ocorreu um erro durante a fase de negociação de protocolo Jabber com o servidor.";


/* TLSError Title */
"TLSError_Title" = "Erro de TLS";

/* TLSError Message */
"TLSError_Msg" = "Ocorreu um erro na camada de segurança da ligação ao servidor.";


/* AuthenticationError Title */
"AuthenticationError_Title" = "Erro de Autenticação";

/* AuthenticationError Message */
"AuthenticationError_Msg" = "Os seus dados de autenticação não foram aceites pelo servidor. Verifique se introduziu o seu Jabber ID e a sua password correctamente. Pode alterar estas definições na secção \"Contas\" das Preferências da aplicação.";


/* TemporaryAuthenticationFailure Title */
"TemporaryAuthenticationFailure_Title" = "Falha Temporária de Autenticação";

/* TemporaryAuthenticationFailure Message */
"TemporaryAuthenticationFailure_Msg" = "Os seus dados de autenticação não foram aceites devido a uma falha temporária no servidor. Por favor tente ligar-se novamente mais tarde.";


/* SecurityLayerError Title */
"SecurityLayerError_Title" = "Erro na Camada de Segurança";

/* SecurityLayerError Message */
"SecurityLayerError_Msg" = "Ocorreu um erro na camada de segurança da ligação ao servidor.";


/* ResourceBindingError Title */
"ResourceBindingError_Title" = "Erro na Definição da Localização";

/* ResourceBindingError Message */
"ResourceBindingError_Msg" = "Ocorreu um erro durante a definição da Localização (resource) para a sua ligação.";


/* ConnectionClosed Title */
"ConnectionClosed_Title" = "A Ligação foi Fechada";

/* ConnectionClosed Message */
"ConnectionClosed_Msg" = "A sua ligação foi fechada de forma inesperada pelo servidor.";


/* NoJabberIDError Title */
"NoJabberIDError_Title" = "Jabber ID Não Definido";

/* NoJabberIDError Message */
"NoJabberIDError_Msg" = "Por favor introduza um Jabber ID para esta conta usando a secção Contas na janela das Preferências da aplicação.";

